[
    {
        "url": "https://english.onlinekhabar.com/special-arrangements-for-visually-impaired-and-physically-disabled-voters.html",
        "title": "Special arrangements for visually impaired and physically disabled voters - OnlineKhabar English News",
        "content": "Home » Politics » Special arrangements for visually impaired and physically disabled voters Kathmandu, February 13 The Election Commission has announced special arrangements for visually impaired voters, persons with physical disabilities, and those unable to mark their ballots independently in the upcoming election. The Commission stated that pregnant women, persons with disabilities, senior citizens, the sick, individuals in mourning rituals, new mothers, and other voters, including gender and sexual minorities, will be allowed to vote on a priority basis without standing in line. Voters who are visually impaired, physically disabled, or otherwise unable to mark their ballots on their own may request permission from the polling officer to take a member of their immediate household into the private voting area to assist them. The polling officer may grant such permission upon request. If a visually impaired or physically disabled voter seeks assistance in marking the ballot, the polling officer is required to provide necessary support, according to the Commission. The election for members of the House of Representatives will be held nationwide on Falgun 21. The Commission said polling centres and stations have already been finalised, and policies have been formulated regarding their management, including special voting arrangements for visually impaired and physically disabled voters.  Subscribe to Onlinekhabar English to get notified of exclusive news stories. The English Edition of Nepal's No 1 News Portal  Onlinekhabar.com Phone +977-1-4780076, +977-1-4786489 Email: english@onlinekhabar.com"
    },
    {
        "url": "https://english.onlinekhabar.com/nepals-election-manifestos-absent.html",
        "title": "Nepal’s election campaign gains pace but manifestos remain absent - OnlineKhabar English News",
        "content": "Home » Cover » Nepal’s election campaign gains pace but manifestos remain absent As the House of Representatives election scheduled for March 5 draws closer, candidates have already begun campaigning. They are meeting voters and conducting door-to-door outreach in their constituencies to seek public support. On digital platforms, too, candidates have been strengthening their presence with the same aim. One critical element, however, is missing: none of the political parties has released a manifesto. A manifesto is among the most important tools in an election, offering voters a clear basis on which to judge candidates and parties. Yet parties appear to be avoiding this essential responsibility. As of this writing, just 36 days remain until the election, but no party has published its manifesto. Candidates are therefore campaigning without clearly articulating their policy priorities or governing vision. The election date was announced six months ago, following the formation of an interim government under Prime Minister Sushila Karki after the Gen Z–led protests of September 8 and 9. Political parties had ample time to prepare and present their manifestos. Their failure to do so has prompted growing public concern. Political analyst Saugat Gautam says that because all major parties have already selected their prime ministerial candidates, many contenders are focused more on promoting those figures than on communicating their own plans and agendas. As a result, he says, the campaign has become increasingly centred on individuals rather than policies. “The sooner the manifesto is published, the better,” Gautam says to Onlinekhabar. “If there is a delay, people will have less time to critically assess it.” Concerns over the delay have also been voiced on social media. Rakshya Bam, a Gen Z activist, has publicly urged parties to release their manifestos as soon as possible. “We want to read your manifesto,” she writes. “The public will vote based on the plans and agendas you intend to implement after becoming parliamentarians. Be accountable to the people and publish your manifesto.” Online criticism has continued to grow, though political parties appear largely unresponsive. Writer Srijana Pokhrel noted in a recent social media post that more than a dozen candidates contesting the election are her Facebook friends, representing different parties. She said she reviewed each of their profiles but did not find a single candidate who had pinned their party’s manifesto. Pokhrel also criticised candidates who ask voters to judge them by their records, arguing that such records are often “disgraceful.” At the same time, she questioned candidates with no political track record, asking whether they expect voters to support them based solely on an introductory video. “This is an election, not a beauty pageant,” she wrote. The Nepali Congress, for its part, says it is still in the preliminary phase of drafting its manifesto. “We are still at an initial stage and are consulting experts from different sectors,” says Pratap Paudel, political adviser to Gagan Thapa, the party’s president. Paudel says the manifesto had not been delayed, adding that election-related activities already underway may have created the perception that its release was overdue. “In fact, manifestos are usually announced only about a month before the election,” he said. He added that Thapa is currently campaigning in Sarlahi and that a party meeting will decide the date of publication after his return. Thapa is leading the manifesto drafting process for the Nepali Congress. Unlike the Nepali Congress, the CPN-UML says it is in the final stage of preparing its manifesto. “We are almost ready to publish it,” says Min Bahadur Shahi, head of the party’s publicity department. Shahi said a few issues still required internal discussion before the manifesto could be released. “We are trying to publish it as soon as possible,” he added. The Rastriya Swatantra Party has informed that it plans to release its manifesto on February 13. “We are reviewing the draft and compiling suggestions and findings from provincial consultations and field studies,” says Manish Jha, the party’s spokesman. The manifesto is being drafted under the leadership of Swarnim Wagle, the party’s vice chairman. Jha said that because candidate nominations were filed 45 days ahead of the election, compared with 17 days in previous cycles, many people felt the manifesto announcement was overdue. Krantishikha Dhital, a central committee member of RSP actively involved in drafting the manifesto, said the party would release practical and achievable pledges rather than grand, unrealistic promises. “We are not preparing impossible or irresponsible declarations. The manifesto is being drafted in a way that directly addresses the concerns of young people,” says Dhital. “We will come forward soon with proposals that reflect the public’s expectations. Our focus will be on education, health care, employment and capital formation.” With just over five weeks remaining before voters go to the polls, the absence of manifestos has left many unsure how to compare candidates beyond personalities and past affiliations, raising broader questions about accountability and policy-driven debate in the campaign’s final stretch. Party leaders also acknowledge that delays in releasing the manifesto could make it more difficult for voters to compare candidates. Prasun Sangroula is an Onlinekhabar correspondent, mainly covering arts, society and sports. Subscribe to Onlinekhabar English to get notified of exclusive news stories. The English Edition of Nepal's No 1 News Portal  Onlinekhabar.com Phone +977-1-4780076, +977-1-4786489 Email: english@onlinekhabar.com"
    },
    {
        "url": "https://english.onlinekhabar.com/humla-raising-election-concerns.html",
        "title": "Snow shuts roads in Northern Humla, raising election concerns (Photos) - OnlineKhabar English News",
        "content": "Home » Cover » Snow shuts roads in Northern Humla, raising election concerns (Photos) Kathmandu, February 11 As Nepal approaches elections to the House of Representatives, road access to northern Humla has been severed following days of relentless snowfall, isolating remote Himalayan settlements and raising concerns about voter participation. Heavy snow has blocked key mountain routes, and residents say there is little immediate prospect of reopening them. Roads at Nara La in Namkha Rural Municipality–5 and Nyalu La in Ward 6 have been completely shut after several feet of snow accumulated along the passes. In Namkha’s villages of Limi, Til, Jang and Halji, many registered voters are currently outside the district, further compounding fears that turnout could be affected. At the Hilsa border point, temperatures have plunged to minus 22 degrees Celsius, according to the Armed Police Force’s Border Outpost there, intensifying the already harsh winter conditions. Krishna Dahal, the officer in charge of the Hilsa outpost, said snowfall has made it difficult even to patrol up to border pillars 8 and 9. He added that between three and four feet of snow has piled up at Nara La. Ward Chair Paljor Tamang of Namkha–6 said that of the 672 registered voters assigned to three polling stations in Limi, most are currently in Kathmandu, Delhi and other parts of India, a factor that could significantly affect voting. With the election drawing near, Tamang urged the government to clear the snow from Nara La and Nyalu La without delay. Subscribe to Onlinekhabar English to get notified of exclusive news stories. The English Edition of Nepal's No 1 News Portal  Onlinekhabar.com Phone +977-1-4780076, +977-1-4786489 Email: english@onlinekhabar.com"
    },
    {
        "url": "https://kathmandupost.com/national/2026/02/13/remote-settlements-in-jumla-and-upper-dolpa-left-out-of-election-campaign",
        "title": "Remote mountain villages in Jumla and upper Dolpa see no election campaign",
        "content": "With less than three weeks left for the House of Representatives elections, voters in remote parts of Jumla and upper Dolpa say candidates have yet to reach their villages, forcing many to vote without meeting them or hearing their agendas firsthand. In Khopri village, which lies in ward 9 of Tila Rural Municipality in Jumla, residents said they rarely get to meet candidates. Locals say they cast their ballots based on party affiliation or what they hear about candidates from others. “We have elected several lawmakers, but after they became MPs, we neither saw development nor had any contact with the candidates afterwards,” said Kali Bahadur Thapa. “Our hardships remain the same. Their status changed, ours did not.” On Wednesday, Rastriya Prajatantra Party candidate Gyan Bahadur Shahi visited Khopri village. Locals shared their issues related to roads, electricity, drinking water, health and education. Shahi urged them not to expect development directly from him, explaining that he was heading to a policy-making forum and coordination with provincial and local governments would be needed to address demands. Jumla has a single constituency for the House of Representatives, with 10 candidates, including one independent in the fray. Candidates have intensified campaigning in accessible settlements, visiting some areas repeatedly, but only a few have reached geographically remote villages. Upper Khopri has 35 households and lower Khopri 21, with around 200 voters in total. Chhabilal Thapa said that with the elections drawing near, most candidates have yet to visit. “We have pressing problems here. Roads, electricity, drinking water, health and education are lacking. We are eager to present our issues when candidates come,” he said. Election activity is also minimal in Shifti of Kankasundari Rural Municipality and Marphan and Huri Mohari of Patarasi Rural Municipality, where road access is lacking. Voters in these settlements remain busy with farming and their occupations, with little sign of campaign outreach. Health facilities in Khopri are limited. A community health unit operates in the village, but the Ransamalapani Health Post, which has a birthing centre, lies about nine kilometres away. In the second week of January, 27-year-old Ramita Thapa gave birth to a baby girl on the snowy trail at Chhayapatan while being carried to the birthing centre. In the past year, more than six women have delivered on the way to the facility. School buildings in the village are old and dilapidated. “There are many problems in this village,” Thapa said. “We had hoped to raise these issues and demand solutions once the candidates came to the village. But so far, most of the candidates have not reached us.” A similar situation has been reported in upper Dolpa. In the northern region, including Shey Phoksundo, Dolpobuddha and Chharkatangsong rural municipalities, election activity remains absent, locals say. Seven candidates from different parties are contesting the Dolpa seat. However, they are largely focused on lower Dolpa, engaging in door-to-door campaigns and voter meetings there. “No candidate has come to seek votes in Dho village so far,” Pema Chhewang Gurung, a youth from Takshe in Dolpobuddha Rural Municipality, told the Post, adding that many residents remain unaware of the elections due to limited communication access. “Election day is near, but there is no campaign activity here. Candidates should be meeting people and asking for votes,” he said. “Everyone wants the votes of upper Dolpa residents. But no one seems in a hurry to meet them. Those who have time to repeat door-to-door campaigns in lower Dolpa appear to be ignoring upper Dolpa,” he added. Dho Tarap, regarded as one of the world’s highest human settlements, has also seen no campaign visits. Residents say leaders have long treated upper Dolpa as a vote bank while neglecting education, health, transport, electricity and communication services. Upper Dolpa’s three rural municipalities have a total of 4,366 voters, many of whom say they have yet to see a single candidate in person as the election approaches. Neupane works at the microbiology lab at Agricare Nepal. "
    },
    {
        "url": "https://kathmandupost.com/visual-stories/2026/02/13/pashupatinath-sees-influx-of-sadhus-and-devotees-ahead-of-shivaratri",
        "title": "Pashupatinath sees influx of sadhus and devotees ahead of Shivaratri",
        "content": "As Shivaratri approaches, the premises of Pashupatinath Temple have witnessed an influx of sadhus, babas and devotees from across the country and beyond over the past few days. The temple, dedicated to Lord Shiva, is a major spiritual hub, particularly during Shivaratri, one of the most significant festivals in the Hindu calendar. On Friday, the area around the temple remained busy, with pilgrims arriving early to take part in rituals and prayers. Domestic and international visitors gathered to seek blessings. Babas from India were prominently visible, adding to the festive atmosphere. The surrounding area has seen a noticeable rise in the number of babas, who are traditionally associated with Shivaratri celebrations and often draw the attention of pilgrims and tourists alike. Shivaratri, observed as one of the most sacred nights in the Vedic calendar, falls on February 15 this year. Authorities expect a large turnout of devotees at the temple. Here are some photos taken by the Post’s photojournalist Deepak KC."
    },
    {
        "url": "https://kathmandupost.com/money/2026/02/05/budhigandaki-back-in-spotlight-amid-election-buzz",
        "title": "Budhigandaki back in spotlight amid election buzz",
        "content": "It's election season, and once again the much-awaited Budhigandaki hydropower project is back on the national agenda, creating renewed buzz and political attention. The proposed 1,200-megawatt project, with an estimated cost of nearly $3 billion including inflation and interest during its proposed eight-year construction period, is Nepal’s largest reservoir-type hydropower scheme. Insiders describe it as a long-term energy security project, particularly because it is expected to generate 1,408 gigawatt hours (GWh) of electricity during the dry season, when Nepal faces acute power shortages and relies heavily on imports from India. Against this backdrop, a signature campaign was launched in Dhading, the project site, during the Dhading Festival on January 31. The campaign, which will continue until February 8, aims to put pressure on the government to finally move the long-stalled project forward. Local residents say the campaign is intended to push authorities into action, especially after the government recently finalised the project’s investment modality. This development has raised new optimism among communities that have waited decades for the project to take off. Envisaged as a cornerstone of Nepal’s energy security for generations, the Budhigandaki project has remained in limbo due to prolonged uncertainty over its financing model and the geopolitical sensitivities surrounding it. The storage-type plant, which will store water during the monsoon and generate electricity in the dry months, was first identified during the Gandaki Basin Study in the late 1970s, followed by a pre-feasibility study in 1984. Participants of the signature campaign say the project has repeatedly featured in election manifestos of major political parties but has never progressed beyond promises. The Dhading Chamber of Commerce and Industry, which is spearheading the campaign, says this time, it is determined to ensure tangible outcomes. Chandra Prasad Dhakal, president of the Federation of Nepalese Chambers of Commerce and Industry (FNCCI), became the first person to add his signature to the campaign. Following the signing, he urged the government to immediately advance the construction process, stating that the private sector is ready to cooperate in taking the project forward. On January 18, the government approved the long-pending investment modality of the project, clearing a key hurdle for its transition into the construction phase. Including inflation and interest costs during construction, the total project cost is estimated at Rs406 billion. Under the approved financial structure, 70 percent of the project cost will be financed through debt and the remaining 30 percent through equity. The construction period has been estimated at eight years. Once completed, the project is expected to generate 338 million units of electricity annually—141 million units in the dry season and 197 million units during the rainy season. The proposed electricity purchase rates stand at Rs12.40 per unit in the dry season and Rs7.10 per unit in the wet season. Annual revenue from power generation is projected at Rs31.48 billion. The electricity generation licence for the project is proposed to be valid for 50 years. If construction is completed within the stipulated eight years, the plant would generate electricity for the remaining 42 years of the licence period. So far, the government has already invested Rs45 billion in the project, which will be converted into equity shares. Under the proposed equity structure, the 30 percent equity position will be shared as follows: the Ministry of Energy will hold a 50 percent stake, the Ministry of Finance 30 percent, and the Nepal Electricity Authority 20 percent. The project company also plans to issue energy bonds worth Rs30 billion. To fund the project, the government has already collected Rs168 billion by imposing a tax on petroleum products. In May 2015, a levy of Rs5 per litre was imposed specifically under the Budhigandaki project heading. According to the Nepal Oil Corporation, more than Rs22 billion was collected under this heading. In fiscal year 2018-19, the tax was rebranded as ‘infrastructure development tax’ and raised to Rs10 per litre. Ramkumar Dallakoti, president of the Dhading Chamber of Commerce and Industry, said the signature campaign is intended to push the government to build the project at any cost. He said the project would not only transform Dhading and Gorkha districts but also benefit the national economy through job creation and business growth, making its immediate construction imperative. Dallakoti expressed frustration that despite the displacement of centuries-old trade routes in northern parts of Dhading and Gorkha, the long-held dream of local communities to see the project materialise remains unfulfilled. He said the campaign aims to draw the attention of concerned authorities and resolve issues caused by prolonged delays. Around 50,000 residents from 23 former village development committees (local units) in Dhading and Gorkha have already agreed to relocate for the project. However, repeated postponements have deprived them of development opportunities, leaving many frustrated. Locals say they were prepared to leave their ancestral homes for a project of national pride, only to see it stalled for years. Yamnath Danai, chair of Jwalamukhi rural municipality, accused the federal government of neglecting the project, echoing widespread local anger. From its inception, the Budhigandaki project has been mired in controversy, particularly over geopolitics. At various stages, it has been linked to Chinese state-owned companies, triggering concerns in some quarters about debt exposure, strategic influence and long-term control over critical infrastructure. Nepal’s delicate position between China and India has turned the project into a symbol of how major infrastructure initiatives can become entangled in regional rivalries. Critics argue that repeated policy reversals have had less to do with technical or financial feasibility and more with shifting geopolitical calculations and changes in government. Insiders, however, contend that labelling Budhigandaki as a geopolitical project has unfairly delayed a scheme crucial for Nepal’s energy security, water regulation and economic growth. Located about 2 kilometres upstream of the Trishuli–Budhigandaki confluence at the border of Gorkha and Dhading districts, roughly 80 kilometres west of Kathmandu, the project has undergone multiple studies over the decades. It was first identified in 1978 by Snowy Mountains Engineering Corporation, an Australian government-owned company at the time, and initially conceived as a 200–300 megawatt storage project. A pre-feasibility study in 1984 recommended an installed capacity of 600 megawatts. After a gap of nearly 26 years, the Nepal Electricity Authority re-evaluated the project in 2010-11. A final feasibility and detailed design study conducted by France’s Tractebel Engineering in 2015 proposed a 1,200-megawatt plant with six 200-megawatt Francis turbines. Despite this, the project has been repeatedly pulled back and forth by successive governments. In 2017, the then Pushpa Kamal Dahal-led government awarded the contract to build the project to China Gezhouba Group Corporation (CGGC) without competitive bidding, adopting the engineering, procurement, construction and financing (EPCF) modality. The decision was overturned in November 2017 by the Sher Bahadur Deuba government, which cited procedural flaws in the awarding of the contract. Following the cancellation, the Deuba administration announced plans to develop the project using domestic financial resources through the state-owned Nepal Electricity Authority. The project was again drawn into political controversy in September 2018, when the KP Sharma Oli-led government reversed the earlier decision and opted to re-engage the Chinese developer, effectively abandoning plans to rely on internal financing. In April 2022, the Deuba administration once again revoked the licence issued to CGGC and declared that the project would be constructed by mobilising domestic resources. Following the latest policy reversal, a committee led by then National Planning Commission vice-chair Swarnim Wagle was formed to explore financing options for the project. The committee recommended that the government develop Budhigandaki on its own, with viability gap funding covering about one-third of the total project cost. Although the Cabinet approved the committee’s report and agreed in principle to provide the gap funding, the decision was never formally minuted as the Deuba government fell before it could be implemented. The subsequent Oli-led administration, which had publicly criticised Deuba for scrapping the deal with the Chinese company, disowned its predecessor’s decision, once again leaving the project in uncertainty. As elections approach again, locals say patience is running thin. Yadunath Sapkota of Khahare in Tripurasundari Rural Municipality urged the government to either immediately begin construction or ensure sustained development in the area, which he said has lagged for years in the name of the project. The signatures collected in the ongoing campaign will be submitted to the government, as locals hope that this time, Budhigandaki will finally move beyond promises and politics. Sangam Prasain is Business Editor at The Kathmandu Post, covering tourism, agriculture, mountaineering, aviation, infrastructure and other economic affairs. He joined The Kathmandu Post in October 2009. "
    },
    {
        "url": "https://kathmandupost.com/politics/2026/02/12/parties-finalising-election-manifestos-as-ncp-publishes-its-document",
        "title": "Parties finalising election manifestos as NCP publishes its document",
        "content": "Three weeks before the House of Representatives election, Nepal’s political parties are unveiling their manifestos, with the Nepali Communist Party (NCP) releasing its ‘commitment document’ on Tuesday. The Nepali Congress is preparing its electoral promises (pratiyaga patra) while other parties are also finalising their plans. Likewise, the Rastriya Swatantra Party (RSP) says its ‘pledge document’ (bacha patra) will serve as a contract with the people, adding that there should be clear provisions for penalties if the promises are not fulfilled. The CPN-UML has yet to decide whether the report it plans to publish—incorporating the party’s electoral promises—will be called a manifesto or it will be given another name. Political analysts say that while parties may use different names instead of calling their documents manifestos, making it easier to distinguish one party’s document from another, what ultimately matters is the agenda political parties present in them. They note that these papers—whatever their name—later become the basis for questioning political parties about their performance. For example, parties can be held accountable for the economic growth targets they promise in their manifestos should they form a government after election. Sociologist and political analyst Uddhab Pyakurel says that in Nepal, even parties that have no clear prospect of reaching government often publish manifestos promising what they would do if they came to power. This, in his view, reflects a largely ritualistic approach to manifesto-making. “During their election campaigns, when political parties reach out to people at their doorsteps, two questions should not be overlooked,” Pyakurel told the Post. “What role will the candidate fulfil as a lawmaker? And, if their party comes to power, what will be the government’s main priorities?” Pyakurel believes that since voters have stopped using party manifestos as a basis to question political leaders, candidates such as Balen Shah, the former mayor of Kathmandu Metropolitan City, have been able to campaign without presenting a clear agenda. A party manifesto represents the institutional position of the party. However, analysts say that in the upcoming election, Nepali politics appears to be moving increasingly towards personality-centred leadership. As major parties project particular individuals as their prime ministerial candidates, questions can be raised about the influence of such institutional documents. The NCP’s commitment paper, unveiled on Tuesday at the party headquarters in Perisdanda, Kathmandu, prioritises several key agendas. These include ending linguistic discrimination and allowing “a hundred flowers to bloom”, developing a self-reliant national economy, practising socialism right from local level, and advancing socialism with Nepali characteristics. The document also emphasises “quality service delivery to people’s doorsteps as the foundation of democratic governance”, while giving priority to good governance, transparency, and frugality as the basis for economic development and prosperity. It further pledges to improve education and health infrastructure, promote entrepreneurship as a foundation of prosperity, support entrepreneurial families, and create jobs in every village and town, reaching households across the country. The Congress is publishing its manifesto as ‘Vision–10’ in the next few days. Party spokesperson Devaraj Chalise said the document will reflect the country’s realities, and focus on good governance, development, and practical action plans. Chalise added that the manifesto will go beyond aspirations, clearly outlining resources and methods for implementing plans. The party earlier collected suggestions from the districts, to be aligned with national priorities. The manifesto will present practical programmes and speak for all citizens, regions, and communities, Chalise said. “It will also seek to address the youths’ concerns expressed during the September Gen Z uprising.” UML Deputy General Secretary Lekhraj Bhatta says his party’s manifesto will prioritise addressing the problems the country is facing. Following the Gen Z movement, Nepali society has seen two clear divisions. While one group supports the uprising, the UML interprets it as a conspiracy against the nation. Party Deputy General Secretary Bhatta says his party will highlight this issue prominently in its manifesto, alongside other key topics. “In addition to economic development, good governance, and service delivery, the manifesto will focus on protecting national sovereignty and unity, using the destruction on the second day of the Gen Z movement, September 9, as a reference for the harm caused to the country,” Bhatta told the Post. The RSP, on its official social media, has said it will first publish the “contract” document, followed by the pledge paper outlining its commitments in clear terms. “We will clearly present our agenda to citizens and enter into a contract with them. We will promise only what we can deliver—and deliver what we promise,” the party says. With only 22 days until the House of Representatives vote, the Election Commission has instructed political parties to publish their manifestos by February 15. According to the commission’s timetable, official campaigning will begin on February 16, and all political parties are required to make their manifestos public a day in advance. The parties must submit the manifestos to the Election Commission, while candidates are required to submit them to their respective election offices, as per Section 57 of the Political Parties Act, 2017. "
    },
    {
        "url": "https://kathmandupost.com/politics/2026/02/06/in-the-election-build-up-rsp-faces-increased-scrutiny",
        "title": "In the election build-up, RSP faces increased scrutiny",
        "content": "The Rastriya Swatantra Party (RSP), which emerged as the country’s fourth-largest political force in the 2022 elections by criticising the flawed political culture of older parties, is itself being criticised for its recent un-political activities. From the closed list it submitted to the Election Commission under the proportional representation (PR) system to the anomalies seen in its election campaign, the party’s missteps mirror those of the established parties it once challenged. In violation of election rules, the party replaced the highest number—38—of candidates among all the parties in its closed PR list. In the closed list, a party can include only new candidates in place of those who opt out. However, even as only two candidates withdrew from the closed list, the party replaced an additional 36 candidates. It also violated its own rules in selecting the first-past-the-post (FPTP) candidates. The selection of candidates through primary elections was a key differentiator for the party. However, it failed to implement the primary rule even after raising thousands of rupees from the aspirants. It charged Rs25,000 from each aspirant for the FPTP. However, shortly before the Election Commission’s January 20 deadline for candidate registration, the party said it was still in the process of unification and ultimately did not conduct the primaries. The party argued that holding primaries at that stage would have been unfair on new members who had entered the party through recent mergers, and cited lack of time as another reason for not following the plan. Even so, the party faced criticism for not refunding the Rs25,000 each collected from those who had expressed interest in participating in the primaries. Pranay Rana, an aspiring candidate from Kathmandu constituency-5, has demanded that the party return the Rs25,000 it collected in the name of holding primary elections. After the party collected the fee for the primaries but eventually nominated Sasmit Pokharel as the candidate from the constituency without internal contest, Rana posted a video on social media on February 3 and demanded that his money be refunded. However, the party’s co-spokesperson, Pratibha Rawal, disagrees with Rana’s claim. “The fee collected from those wishing to run as first-past-the-post candidates was not meant for holding primaries, but rather a charge for expressing interest in being a party candidate,” Rawal said. She added that Rana is making accusations only because he was not picked as a candidate. The party has previously been accused of failing to make public the results of the primary elections it conducted. A few months ago, the party held a primary for the by-polls that were supposed to be held in November for the House seat in Rupandehi-3. Although the by-election was postponed following the Gen Z protests in September, the party never disclosed how many votes each contender received. The RSP candidates have made more mistakes on the campaign trail. A few days ago, the Election Commission sought clarification for the second time from RSP candidate Balendra (Balen) Shah who is challenging four-time prime minister KP Sharma Oli in Jhapa-5 constituency. According to the commission, the clarification related to an audio-visual material related to Shah’s election campaign. The commission said a complaint had been lodged alleging that plainclothes police asked voters to support Shah. The commission had also expressed concern over the reported deployment of plainclothes police alongside Shah’s wife during the campaign. Asking what exactly happened in the incident, the commission has instructed Shah to submit a written clarification. The commission warned that if a candidate or individuals acting on their behalf are found to be involved in activities that violate the Election Code of Conduct, action will be taken in accordance with prevailing election laws. Earlier, the commission had also sought clarification from Shah over a comment he made on UML chair Oli’s Facebook post. Analysts say mistakes during campaigning are not limited to RSP candidates; others have also taken such missteps. However, they argue that criticism is natural when a party that rose to prominence by criticising older parties and their corrupt political culture ends up emulating them. “Politics in any country is a reflection of the society, and the RSP is no different, as it is a product of Nepali society,” said Pitambar Bhandari, head of Conflict, Peace, and Development Studies at the Tribhuvan University. “But while the party presents itself as fundamentally different from others, its actions do not fully support that claim.” But the party’s joint general secretary, Bipin Acharya, maintains that the RSP is still evolving. Yet, when partial information about its activities comes to light, it faces criticism. “We understand that there are no excuses for flouting election laws and election code of conduct. So the RSP is complying with them,” said Acharya. “However, being a highly visible and much admired party, even minor mistakes are being amplified.” The party is also accused of using children in its election campaign. Speaking at a press conference organised by the Nepali Congress central office in Lalitpur on Thursday, party spokesperson Devaraj Chalise said they were preparing to file a written complaint with the Election Commission over the issue. “The use of children in election campaigning is objectionable. We will lodge a complaint on this matter,” Chalise said, without naming a party. Before that, the party had conducted a primary election to select the RSP’s candidate for the proportional representation (PR) list. However, when the people who did poorly in internal evaluation were placed higher when the party submitted its PR list to the election commission, RSP was criticised for placing individuals close to party leaders ahead of others. Amid such allegations, however, the party claimed that the primary election conducted for the proportional category was incomplete. The party maintained that the primary election would carry a weight of 50 in determining PR candidates, while the remaining 50 marks would be decided through an internal evaluation. Acharya, the RSP joint general secretary, claims that the party is still playing by the rules. At the time, the provision requiring individuals interested in participating in the proportional primary to pay a fee of Rs50,000 also drew criticism. Some leaders in the party opposed the rule, arguing that proportional representation is meant to include minorities and communities that have struggled to enter mainstream politics. Requiring a Rs50,000 payment simply to compete in the primary, they said, undermined that objective. Their concerns, however, went largely unaddressed. However, party co-spokesperson Rawal claims that the amount was intended for those who could afford it, while 25 individuals who could not pay still contested the primary for PR. "
    },
    {
        "url": "https://kathmandupost.com/art-culture/2025/04/26/three-generations-devoted-to-care-of-central-zoo-animals-be-anybody-s-climb",
        "title": "Three generations devoted to care of Central Zoo animals",
        "content": "“They were still young when they were rescued and brought to the zoo,” Hari Krishna Shrestha says. “They were put in the zoo nursery and I cared for them.” Life-size taxidermy mounts of a pair of lemurs face each other and placed atop a table inside the meeting hall of the Central Zoo in Jawalakhel. Where for visitors they could pass as decoration, 61-year-old Hari Krishna, a retired caretaker at the Central Zoo, sees the once playful lemurs that played on his lap and jumped on his shoulders, that fed from his hands and were cared for by him when ill. For over 65 years now, the lives of three generations of a family — Hari Krishna, his father Krishna Lal Shrestha (who passed away in 2006), and son Surendra Shrestha — have come to be intertwined with the lives of animals at the Central Zoo, just like these lemurs. From tigers, chimpanzees, lions, rhinos, hippopotamuses, zebras, monkeys, deer, wild buffaloes and many other mammals to different reptiles and birds — as caretakers at Central Zoo, Krishna Lal, who retired in 1980 after working for nearly 20 years, and Hari Krishna, who retired in 2023 after working for 44 years, raised and cared for creatures of all kinds, guarding them during the nights, feeding and cleaning them, and nursing them when ill. They felt the joys of seeing the animals they had raised give birth and the sadness of watching them age and die, alongside the terror of life-threatening encounters involving powerful predators. Seated near the lemur taxidermy, Hari Krishna recounts to me these experiences of his father’s and his 64 bygone years as caretakers. Meanwhile, some hundred metres away in the zoo section that houses tigers and other large mammals, Surendra, who filled his father’s vacant position after his retirement, is occupied in diligently caring for these animals. Lantern, stick and lurking ghosts In 1934, Rana Prime Minister Juddha Shumsher built a private zoo around a historical Malla-era pond on the premises of his Jawalakhel Durbar in Jawalakhel. Elephants, horses, deer, monkeys, tigers, rhinoceroses, clouded leopards, red pandas, bears, palm civets, four-horned antelopes, Himalayan gorals, pheasants, Himalayan monals, lion, gharial crocodiles, porcupines — Juddha’s zoo boasted a collection of rare and exotic animals. The zoo came under government ownership after the political change of 1951, and in 1956, it was officially opened to the public as the country’s only Central Zoo. Around the same year the zoo was built, Krishna Lal was born in the neighborhood of Kumaripati, a stone’s throw from Juddha Shumsher’s durbar and his zoo. According to Hari Krishna, Krishna Lal joined the zoo in 1960 as a night guard. Providing night security was important to protect the animals, Hari Krishna says, as incidents of animal thefts were common. It was also needed to provide round-the-clock checks on animals so anything urgent could be promptly reported. In the 1960s, Jawalakhel was a sparsely inhabited locality in the midst of semi-wilderness. And there was no electricity in the zoo when his father joined, Hari Krishna says. “As the number of visitors to the zoo was very small, the zoo’s trails and grounds were covered in long untended grasses and bushes,” Hari Krishna recalls his father as saying. “And, there was no electricity and bulbs to light up these paths and animal enclosures.” Twenty-six-year-old Krishna Lal was determined to do his duty. But with a dimly-lit oil lantern in one hand and a stick on the other as the only aid, guarding the zoo and its exotic creatures was not easy. But something else threatened his entire project: there were ‘spirits’ lurking around the zoo which scared him in the depths of the night. “Scary sounds rose from the banks of the pond in the zoo after midnight, as if mother and father were fighting and their children crying,” Hari Krishna recounted his father telling him. In spite of the daily horror, Krishna Lal continued to work. A few years after working as guard, he was deputed to different sections of the zoo to care for the animals. In 1980, he decided to give up his position to start another job. Someone had to replace him. “Of course my son,” Krishna Lal suggested. Hari Krishna had grown up listening to his father’s stories of the zoo and the roar of the zoo’s lion that reverberated in Kumaripati locality every day. As a boy, the zoo became a favourite spot of his boyish adventures. Often he accompanied his father to the zoo and when he was around eight, he also began selling buns to visitors from a small box in the zoo. The passion to work with animals stoked early on in his heart, Hari Krishna, at a tender age of sixteen, enthusiastically stepped onto his father’s footsteps. He was designated the duty of a night guard for the first five years. Not much had changed in Jawalakhel and the Central Zoo from his father’s time. A few bulbs had been placed near some animal enclosures while most of the zoo was still shrouded in thick darkness. So, just like his father, with a lantern and a stick he patrolled the zoo, carefully avoiding the paths that his father had counselled him to. “It was scary to guard the zoo at night,” he says. “My father had told me to avoid certain areas around the pond where there were ghosts, and I carefully followed his advice.” Caring, bonding and births After a few years as night guard, Krishna Lal worked in different animal sections. As a caretaker, his first duty every morning was to go around the zoo, observing creatures in each enclosure to ascertain whether the animals were fine or ill, active or not, whether they were eating or not, and report anything unusual to officials. Then he cleaned the enclosures, prepared food and fed the animals. He was also responsible for caring when the animals gave birth or got ill. During his tenure, Krishna Lal cared for all kinds of animals including the Chinese alligator, zebra, chimpanzees, rhinos, lions, tigers, leopards, and birds forging close bonds with them. What Hari Krishna recalls most prominently is a pair of chimpanzees. Kanchha and Kanchhi, a chimpanzee pair, arrived at the Central Zoo in 1971 from the Cincinnati Zoo in the US in exchange for red pandas. They had spent their lives in a circus travelling and performing for large crowds and had reached old age when they were bought by Cincinnati Zoo. They drank tea and coffee and smoked cigarettes in addition to performing all sorts of acrobatic routines they had been trained in the circus. They became Central Zoo’s star inmates, with visitors thronging to see them. These chimpanzees came under Krishna Lal’s care. “My father was the one who fed them and cared for them, giving them tea, coffee, and cigarettes,” Hari Krishna says. When Krishna Lal decided to leave the job and Hari Krishna was to replace him, he called the latter. “Always love animals,” he told Hari Krishna, sharing his lessons from 20 years of caring for animals. “When you treat them with love, they won’t attack you.” Over years and decades, Hari Krishna cared for many of the same creatures his father had looked after for many more, his father’s words rooted as rock-solid foundation of his works. With deep fondness he remembers a zebra, tigers, rhinos, wild buffaloes, langurs, monkeys, a hippopotamus, a lynx, lemurs, and different birds, among others, that he cared for. Some were specifically close to his heart. Thuli and Sani — a pair of tiger cub siblings rescued from the jungles of Chitwan and brought to the zoo in 1982. Here they became Hari Krishna’s pampered pets. He fed them milk from bottles and played with them. Thuli and Sani ran towards him and jumped on him, and understood his communication. They developed a unique bond, and Hari Krishna even took them for strolls around the zoo. At 18, Hari Krishna took charge of Sani and Thuli and raised them and their love stayed with him as a child’s to father’s. This tenderness moulded in his late teens continues to resonate in 61-year-old Hari Krishna’s memories of Sani and Thuli today. “Their eyes were barely open when they came,” he recalls. “I tied chains around their necks and took them on a stroll around the zoo until they grew the size of a German shepherd. They obediently came if I called, they obediently sat if I asked them to. That’s how well I’d trained them.” One day during their walks, Sani and Thuli charged and slightly injured a visitor and they were caged since then. But they were still cared for by Hari Krishna and knew him well. Hari Krishna eventually looked after and developed a strong attachment to many tigers. “Perhaps because I cared for tigers since I was very young, and I cared for Thuli and Sani, of all the creatures I cared for, I feel the closest to tigers,” he says. A pair of siamang, known for their musical chorus singing, arrived from Malaysia in exchange in 2000 and was put under his care. Hari Krishna and other zoo officials lovingly called them Kale and Kali. Approaching retirement, Hari Krishna raised a pair of lemurs rescued from Kathmandu. As caretakers, Krishna Lal and Hari Krishna were also the first to witness births. Hari Krishna could tell when a female creature was pregnant. And he would be the first to discover many creatures with their new ones. In his mobile phone, he pulls a photo of a vervet, a South African monkey, clutching its infant. During one morning round he saw the female vervet surrounded with thick dark blood around her, and on a closer look saw a newborn firmly wrapped in her arms. “Some two months earlier I’d already separated the male vervet to protect the female as I’d noticed her belly rise,” he says. “Now, I could tell from the blood that she’d given birth around 4 am.” He tells me of the many occasions when wild buffaloes, red monkeys, langurs, spotted deer, black bucks, among other creatures that he raised and nurtured, gave birth. “On countless occasions, I was a live witness to spotted deer and black bucks giving birth,” he says. During one morning round in September 2009, he found Kali the siamang who was under his care, carrying its newborn. Over the years, Kale Jr — as the male newborn was called — grew under Hari Krishna’s care. A few months before Hari Krishna’s retirement, Kale Jr, then 14 years old, became ill. “I kept a close eye on him, keeping track of his activities and what he ate from the fruits and vegetables I gave him. I’d make sure that he ate,” he says. A mobile clip from that time shows Kale Jr, pale and sad eyed munching on something from a plate of fruits and vegetables before him. With Hari Krishna’s care, he recovered. Chimpanzee rips off finger, Thuli readies to charge Love alone did not ensure safety from animals that could naturally turn violent at any time. Animals’ confinement in small, narrow enclosures added to their frustration and violent behaviour. Moreover, due to a lack of adequate space separating enclosures from visitors, animals were incited by visitors teasing and even poking at them with sticks. In fury, the creatures turned to visitors, and over the decades, there were sizable cases of inmates attacking, biting and injuring them. At times, the animals’ wrath spilled to their caretakers. And both the father and son encountered life threatening situations from the very animals that they had closely bonded with. One day, Krishna Lal was feeding coffee to Kanchha or Kanchhi out of a cup as visitors thronged outside the enclosure. Suddenly, the chimpanzee pulled his finger and bit it. Hari Krishna, who was around 10 then was selling buns nearby and witnessed the entire incident unfold. “Some visitor teased the chimpanzee, and in anger it pulled my father’s hand and forced his finger between its teeth, biting it until its upper portion ripped apart and then threw it out of the cage,” Hari Krishna says. The blood-covered piece of finger bounced right by Hari Krishna’s box of buns. He was rushed to Patan Hospital in Lagankhel. “My father couldn’t sleep for three nights because of the pain,” he says. “They tried to reattach the ripped off piece of finger but it wasn’t possible, and he lived with a severed finger all his life.” Years later, Hari Krishna himself was caught in a life threatening situation involving none other than his beloved Thuli. The tiger enclosure had two compartments separated by bars in the middle. When cleaning one compartment, the tigers were locked in the other. One day, Hari Krishna entered the cage and had just begun cleaning when he saw only Sani in the inner compartment. Meanwhile, he heard growling behind him. Turning around, his eyes met Thuli’s and saw her stretch her body and right on the verge of stepping down from the wooden bed in the corner of the room. His fellow caretaker had told him that he had already locked the tigresses. In fact he had forgotten to do so. “Thuli!” Hari Krishna called in spite of the terror raging within. “Thuli grunted in response. She responded as soon as I called her name,” he recalls. “So, I thought that she wouldn’t attack me. I dropped the broom and slipped out the cage. “If you’ve raised an animal, apparently they also don’t harm you. If I’d panicked, Thuli would’ve attacked me, since that’s what animals usually do. But I called her and only after confirming that she won’t attack me, I slipped out. If you stay composed, they don’t feel threatened and won’t harm you.” ‘Sadness of losing animals’ With strict caution, danger from animals could be avoided. But not the pain of seeing the animals they had cared for pass away. Within a few years of arriving in the zoo, Kanchha and Kanchhi died. “Of course, it made my father sad to see them go,” Hari Krishna says. The lemur pair, both around two years old, were rescued by the Division Forest Office, Kathmandu and brought to the Central Zoo in 2017. “They were young when they arrived. I held them in my hands to feed them milk from a bottle. I stayed late to give them medicine and returned home only after 7-8 pm,” he says. “They jumped on my body. They knew me.” During the coronavirus lockdown, they got ill. In August 2020, the female passed away, and four days later the male died too. “They didn’t live long […] You take care of an animal, you raise them, then you see them die,” Hari Krishna says. “It certainly feels sad when you see them die.” In 1995, Thuli, passed away at the age of 13. Sani passed away a year later, aged 14. After the birth of Kale Jr, Kali the mother siamang developed a health issue. In 2011, she died aged 21. Kale the father lived to be 32 and died in 2023. The brutal killing of two rhinos has also remained with Hari Krishna. In 1990, two rhinos at the Central Zoo were poisoned by poachers at night. “The rhinos were found lying dead in the morning. One had its horn severed and taken away,” he says. “Perhaps the poachers didn’t have time to cut the horn out of the second rhino.” Attachment to the animals he cared for is one reason that brings Hari Krishna to the Central Zoo almost every day after retirement. He comes early and walks around the zoo, stopping by enclosures to observe the animals he once tended to, seeing how they are doing. “I still think about them,” he says. “How they are and what they might be doing.” Coming to the zoo also gives him the opportunity to guide his son Surendra. From grandfather to grandson It is 10:15 one fine April morning. Surendra emerges from the wild buffalo enclosure pushing a wheelbarrow full of waste. His pants cuffs are folded up the shin and his face is already glowing from working. Before cleaning, he completed his first daily routine — going around the enclosures of tigers, rhinoceros, hippopotamus, different species of monkeys, wild buffaloes, observing their activity to report any unusual behaviour and illness to the veterinarian. A year and a half after taking over from his father, Surendra is well settled in the responsibility as caretaker. Growing up with Hari Krishna’s countless stories of the zoo and decades-long family legacy as caretakers, Surendra replaced his father with a sense of responsibility and pride. Yet when he actually found himself in the midst of powerful predators like tigers and other gigantic mammals, he was scared. “At first, I was scared to work with the animals,” he says. “I feared the uncertainty of their behaviour. The work was also difficult.” But with him were his father with his encouragement and time-tested advice to fall back on. “Whenever you enter a tiger’s cage, make sure that the animals are locked in the other cage and the doors secured,” Hari Krishna told Surendra just before he started the job. “Always put safety first. Be certain about the monkeys’ activities before you enter their cage.” Gradually, Surendra gained confidence about the behaviour and ways of the animals, how and what instigated them to attack. Not long before Hari Krishna’s retirement, a wild buffalo gave birth. The mother buffalo was not regularly breastfeeding the calf, so it fell upon Hari Krishna to feed it from a bottle. He took this opportunity to prepare Surendra for his future role. In his mobile phone, Hari Krishna shows me a video where he is seen gently holding the calf’s neck up to feed it from a bottle. “Here, I’m teaching Surendra to feed the calf,” he says. He then shows me another clip in which Surendra is emulating his father and feeding the calf under Hari Krishna’s watchful eyes. The baton has truly passed on to Surendra and, with him, over six decades of family legacy of caring for the animals of Central Zoo. “My grandfather cared for the animals at the zoo. My father took over from him,” he says. “I’m delighted to continue this today.” Prawash Gautam is an independent researcher with an interest in social history."
    },
    {
        "url": "https://kathmandupost.com/interviews/2026/02/09/we-cannot-relax-until-the-election-is-over",
        "title": "We cannot relax until the election is over",
        "content": "There are now 24 days remaining until the snap polls scheduled for March 5 in the aftermath of the Gen Z protests. As Nepal approaches the critical date, the Election Commission remains busy with final-minute preparations for an election that has the potential to flip the political landscape of the country. However, the Commission continues to court controversy. The political parties and candidates have largely ignored the election code of conduct and guidelines of the commission regarding women's representation. There have also been reports of changes in the closed lists of candidates. A big roadblock to the elections also seems to be the weather, as doubts have been raised over the feasibility of holding the election in multiple phases. The Post’s Biken K Dawadi and Rajesh Mishra sat down for an interview with the acting chief election commissioner Ram Prasad Bhandari. Excerpts. In what state do you currently find yourself—are you overwhelmed with an influx of work, or in a more relaxed state? We are continuing with our standard daily operations. Regarding the context of election preparations, that work is largely complete. If you look at the Election Commission (EC) grounds now, the tents have already been pitched, and materials are being dispatched from the centres. We have finalised all preparations for the 14 types of materials distributed from the centre. Our District Election Officers and Provincial Election Officers have already procured 37 types of items locally, which are now stored in their respective warehouses. These items are currently being packaged and dispatched to the storage sites near the polling stations. Regarding ballots, the printing for the Proportional Representation (PR) system is complete. For the first-past-the-post system, over 8 million ballots have been printed so far, with approximately 11 million remaining to be printed. Once the printing is finalised, we will transport these ballots. What is the timeline for the delivery of these materials to the districts? We will have dispatched all election materials to the relevant election offices by February 19. Once the polling officers are appointed, they will take custody of these materials and begin their journey to the designated polling stations and centres. The election staff, security personnel and representatives involved in the electoral process will reach their respective stations early to complete all necessary arrangements so that we are prepared and at ease for March 5. As of today, tasks have been decentralised and moved to the local levels. The chief election officers, election officers, and polling officers are now in charge. The chief election officers are judges, while the election officers are Under-Secretaries from the legal sector. Manpower management is being handled at the district level, and these officers will be deployed to their respective locations immediately. Does this imply that the EC is currently in a more relaxed position? One cannot be truly relaxed until the election is successfully concluded. However, the workload is significantly less now because we have cleared many of the major hurdles and established a rhythm. Therefore, regarding election materials and general preparations, we are on track. Recently, there has been a sudden resurgence of discussion on whether the election will be held in one phase or two. How does the commission view it? The EC has never believed in phases from the very beginning. In the context of elections, various questions arise at every critical juncture. These questions remain alive until the election is completed, after which they burst and vanish like water bubbles. The commission has never uttered the words ‘one phase’, ‘two phases’, or ‘three phases’. I have maintained from the start that the election will be held on the scheduled date of March 5, from 7:00 AM to 5:00 PM. What do you see as the major challenges for the remaining 24 days and the counting period? I don’t see any major challenges now. Some wondered if the weather in the Himalayan regions would prevent the election. We wrote to the Department of Hydrology and Meteorology, and they provided a report today based on 30 years of analysis. They predict no natural disasters, snow or heavy rain on March 5. The weather will support the election. Many hoped that out-of-constituency voting would be possible this time around. Why did it not happen? Once an election date is announced, it is not permissible to change the laws or the technology related to the election. With the dissolution of the House of Representatives (HoR) after the Gen Z protests, we do not even have a functioning legislature at the moment. President Ramchandra Paudel stated that this action was taken to save the constitution. Whether it was the revolution of 1951, the movement of 1990, or the people’s movement of 2006, those movements discarded and tore up the old constitutions. However, even after weathering the Gen Z uprising, the constitution has remained alive; it has not been torn or discarded. We must conduct the election within its boundaries. Therefore, after the election date is declared, election-related acts, rules and laws cannot be amended. Without such amendments, the current law cannot accommodate voters abroad or out-of-constituency voting. Is this also why the ‘None of the Above’ (NOTA) option could not be implemented? Yes, the situation is the same for NOTA. Many suggest that we simply need to add one more box to the ballot paper, but adding that box requires constitutional backing. It is not like simply adding a room at an airport; it requires a formal amendment. At this stage, it is not possible. We have seen a blatant disregard for the election code of conduct by parties and candidates. Recently, former chief election commissioner Bhojraj Pokharel slammed the EC for the lack of political will to book the offenders. Why is no action being taken? The Code of Conduct is always issued during elections, and parties often find it difficult to follow. When violations occur, the leadership tries to escape responsibility by blaming others. However, we will now have zero tolerance for such violations. A Central Monitoring Committee has been formed under the coordination of an election commissioner. Below that, there are district-level monitoring committees, as well as committees at the provincial and municipal levels. Furthermore, we have a process for subtle monitoring at various checkpoints. The EC will also appoint various other monitoring officers to ensure compliance. If a violation is proven, the nomination of the candidate can be cancelled even after the election is completed. As we have been clear about this from the start, I believe parties and leaders are being more cautious this time. The ‘dos’ and ‘don’ts’ are explicitly stated for everyone to read. If the EC is forced to be punitive to ensure compliance, the situation will not be pleasant for the parties or candidates. Regarding the PR component, were the closed lists illegally changed? No, that is not the case. If there was a disciplinary action within a party, a breach of their internal order, or if the submitted schedule was not legally sound—meaning there was a legal error—the party has a chance to correct it. However, a change to the submitted list is not permitted under any circumstances. Recent reports suggest that some areas remain highly sensitive. What strategy is being used to ensure a peaceful, free and fair election? You must look at it this way: the commission’s job is to conduct the election, while the government’s job is to guarantee peace and security. The EC has independently categorised areas as high-risk, sensitive, or normal. Security agencies have also performed their assessments. We summoned the heads of security agencies here and asked if they could provide security, and they assured us of their capability. Further, the Nepali people are very resilient. After September 8 and 9, people were frightened, wondering if another plume of smoke would appear in the sky. On October 16, even when the government and other agencies were unable to act, the EC called 40-45 parties for a discussion. We sat for eight hours, which allowed for the venting of pent-up frustrations. After that, the EC and the government initiated multiple efforts to bring stakeholders and civil society together. Each of these efforts has helped build a peaceful climate for elections. Where did the ultimate assurance for this process come from? It came from a comprehensive discussion held at the Office of the Prime Minister in Singha Durbar, involving the EC, political parties, civil society leaders and Gen Z representatives. Before that discussion, the atmosphere was murky regarding who would participate in the election. Spending three or four hours in that discussion cleared the atmosphere. Honestly, we had to struggle to create that environment, but we are now in this stable position because of it. The EC had provided a guideline to the parties to achieve 33 percent women’s representation even in direct election nominations, but it seems this was largely ignored. Are firmer steps needed? Please understand the nuance here. Often, women leaders within parties do not speak up against it in their parties. Most of the older leaders have a specific mindset. The commission issued directives multiple times asking parties to field at least 33 percent women for direct seats. Instead, the parties fulfil the requirement through the PR and do not field women candidates. The commission’s role is to issue directives; we do not have the authority to invalidate their nominations if parties don’t follow through. It ultimately depends on the role of the top leadership of the political parties to follow these directives.  This election has seen the emergence of a significant alternative force. How does this differ from a normal election, and does it require different preparations? The upcoming elections are snap ones, not a periodic one. Everyone, including myself as a referee, is a voter. Previously, even periodic elections didn’t create much enthusiasm, but now nearly 900,000 new voters have been added for the snap election. The commission believes the new generation will be vigilant and ensure a clean, free and fair election. Will the upcoming elections be the most ‘informed’ election to date? Absolutely. We forecast that voter turnout will increase, and the percentage of invalid votes will decrease. People are more interested now. Between the EC's efforts and the parties' campaigns, voters have educated themselves at home on how to vote correctly so their ballots aren't invalidated. Regarding social media usage, there are concerns about buying followers and fake interactions from bots to manipulate voters. How is the commission handling this? I have repeatedly said that people must distinguish between right and wrong information on social media. If it is wrong, discard it. The EC is alert and has discussed with authorised agencies how to keep the election free from the misuse of social media. We are aware that platforms like TikTok can be misused. We have formed various committees and sub-committees to monitor and control this. How are foreigners helping with this election? The entire world is watching. Everyone who cares about Nepal wants to see a successful election, new representatives and the establishment of good governance and peace. The world wants to see Nepal develop peacefully. India has provided over 600 vehicles, and various governments have provided billions in aid, though the specific data sits with the government. Japan's prime minister also expressed readiness to support Nepal's election and governance during our President's recent visit. Even the UNDP provided 8-10 machines and hundreds of computers when we were struggling with where to print voter lists. This allowed us to print everything internally without needing external tenders. While the government coordinates with China, the Election Commission hasn't received direct aid from them yet. Is there any room for doubt left? None at all. Even the Prime Minister, after visiting the Janak Education Materials Centre and seeing the mountains of printed ballots, remarked that only the people's stamps are left to be applied. Let’s change track. Could the EC have played any role in promoting good governance in parties before the Gen Z movement? After four years of study with stakeholder groups, we were prepared to issue a directive about seven months ago. We wanted every political party to conduct a self-evaluation and submit a report to the EC. This would involve parties assessing their own status, their work, public trust and the performance of their representatives. We wanted them to seek public opinion and maintain their own integrity. However, when we called the parties to discuss this, their response was to ask who the Election Commission was to audit or perform a financial inspection of political parties. If the parties had accepted this self-evaluation and presented their findings to the voters and the Nepali people, the Gen Z movement would never have occurred. We simply asked the parties to identify their own standing, but they refused. Today's situation is a result of that. Can this election reflect the spirit of the Gen Z movement? Yes. Elected representatives will capture that spirit and provide good governance. Only elected representatives can establish peace and order by representing the spirit of the GenZ movement. Regarding minor issues, like the police spokesperson mentioning a gap of 1600 four-wheel vehicles, these are small problems that will be addressed during the election. Dawadi is an Op-Ed Editor at the Post. "
    },
    {
        "url": "https://kathmandupost.com/interviews/2026/02/02/post-conflict-elections-are-always-challenging-1769994892",
        "title": "Post-conflict elections are always challenging",
        "content": "As Nepal hurtles toward March 5, the political landscape is being defined by an extraordinary election in an abnormal situation. At a glance, the snap polls seem unprecedented in Nepali political history. A deeper look, however, suggests the first constituent assembly elections, in 2008, were held in even more dire circumstances. The Nepal Police is in disarray now; in 2008, it was defeated. Public frustration over the inadequacies of the political system is brimming now; in 2008, it had overflowed for a decade of insurgency. And a significant alternative force is on the rise now; in 2008, the alternative was surfacing out of jungles. The Post’s Biken K Dawadi sat down with former chief election commissioner Bhojraj Pokharel, who steered the high-stakes 2008 polls that transitioned the nation from armed conflict to a democratic process, to discuss meeting points between that era and today: the historical gravity of the upcoming polls; roles, limitations and necessary reforms of the Election Commission (EC); the complications invited by the rise of a significant alternative political force; and the logistics behind elections. Excerpts. To start with, how do you compare an election under ‘normal circumstances’ to the upcoming one? The March 5 election, I see it as an extraordinary election in an abnormal situation. In our country’s context, the 2008 elections were held under extraordinary circumstances as we had to bring a force that had carried guns for a decade into the electoral process. That was a challenge. Back then, we had to design an entire electoral system and create laws from scratch. It was a completely different kind of challenge. Today, the challenge is primarily one of timing. With a bit more time, the preparation could have been better. So there is a shortage of time to prepare? Yes, they could have prepared better. Further, we are facing an issue of pustantaran (generational transfer). In 2008, the issue was how to lay down the guns; today, the issue is political discomfort. There are political problems and security problems. Back then, the police were essentially a force defeated by the Maoists, and the army was confined to barracks due to the peace process. Today, I see a demoralised police force following the Gen Z movement. Their weapons were stolen, their logistics are damaged, and many are only just coming back in the field. Does this election hold similar historical gravity as the one in 2008? Context matters, and contexts are never perfectly comparable. However, I see a distinct meeting point. In both cases, there is a side that disagrees with the existing system. There is a search for a new force. Even if the new forces in 2008 were violent, people were so tired of the old system that they hoped the ‘new’ would bring something different. There was some hope. Today, I see the same thing: The way the country is being governed is not what people are looking for. People want change. Then or now, the issues remain basically the same: good governance, corruption and accountability. The only difference is that then, we had to bring a conflict-ridden party into the political fold. Now, we have to integrate the opportunities created by the Gen Z movement and manage a generational transfer. In 2008, the Maoists were a big alternative force. Now, the Rastriya Swatantra Party (RSP) is seen as a significant alternative. Does having such a rising alternative force make the logistics and crowd management more challenging? Global history suggests post-conflict elections are always more challenging as the elections are a part of the peace process. The future of peace depends on the conduct of the election. If it fails, the process is derailed. In 2008, we were ‘post-conflict’, but the country was still in the conflict. The peace agreement was fresh, and mindsets hadn’t totally changed. Madhesh was agitated with dozens of armed groups. They threatened to kill anyone involved in the election process—poll workers, candidates, even families. The Election Commission offices were bombed. It is nothing like that today. While you don’t expect that level of violence, is the risk of some violence still there? Yes, all contestants want to win elections. Where parties have strength, they will try to take advantage through any means—Saam, Daam, Danda, Bhed. I fear the high tempo and frustration of the current moment might lead to mob violence during the campaign period. It depends on the tolerance levels of the competitors. What is the role of the EC here? How can they be more proactive in controlling incidents like the recent clashes in Jhapa between Balen and Oli supporters? Election is a game. The players are the candidates and parties; the commission is the referee. There are many laws and a Code of Conduct. The linesmen (the monitors) must point out mistakes correctly. But let’s be clear: security is not the responsibility of the commission; the government must provide it. The commission’s role is to take on-the-spot action against violations so others can see and learn. We had this same fear in 2008, which is why we asked Parliament for the power to have monitors act like traffic police—issuing a ‘bill’ or penalty on the spot. But when the monitors don’t act, isn’t the relevance of the law lost? Exactly. Less people violate the code of conduct when the ‘terror’ of punishment is intact. Action must be visible and immediate. The commission must be vigilant, and other stakeholders—the voters and the observers—must cooperate. If voters don’t cooperate, violence cannot be stopped. We recently saw leaders like KP Oli and Balen Shah bring massive crowds to file nominations, an open flouting of the Election Code of Conduct. The commission demanded clarification from them, but we have yet to see any strict action. If the referee issues a red card but the player keeps playing, does the problem lie with the referee or the rules? You’ve raised a vital point. Rules do exist. A violation can lead to a Rs100,000 fine. The law allows the commission to cancel a candidacy or even vacate a seat after a win if the rules are broken. In 2008, we asked the Parliament for these strict laws. Those laws were passed, but enforcing them is the challenge. Our national capacity is yet to reach a level where a referee shows a red card, and the player immediately walks off. I have experienced this, and see it happening even now. We deal with law as a package, but the formal process of asking for an explanation (clarification) takes long. The red card isn’t shown in time. That gap needs to be plugged. So the laws exist, but the commission just isn't taking action? Again, why not? As I said, there is due process of law. The process of asking for explanations delays everything, while people want immediate action. This creates a paradox: We need the action to be timely, but the due process invites delay in taking action against violators of the code of conduct. We must move from being process-oriented to action-oriented. Second, and I say this honestly, our state capacity—of which the commission is a part—has not developed to the point where it can deliver on these expectations. When the public expects immediate action, and it doesn’t happen, that is where the frustration happens. Do we need more legal updates to fix this, or is the problem a flawed system? For long-term reform, we need to talk about capacity. In many Western democracies, they don’t have these specific laws or a central commission like ours, yet they hold peaceful elections managed by local governments. Here, we deploy staff and police everywhere—it’s like the Mahabharata. Our campaign periods are so long because we centralise everything. We print ballots in Kathmandu and ship them to 165 constituencies. If we decentralised ballot printing to the districts, we could print them in a single night. We need to revisit these centralised processes. How does this relate to the ‘economics of elections’? How big of a burden is this on the taxpayer? The cost is not in billions; it’s in trillions. There is the government’s management and security cost, but also the candidates’ spending. Our current spending is unsustainable. I am worried that money is hijacking election results. To cut costs, first, we must decentralise management, i.e., stop shipping everything from Kathmandu. Second, we must make the political parties accountable for security. Parties create the violence; they should be responsible for the security of their own events. We could use a voluntary force of retired army/police and local volunteers instead of 150,000 temporary police, as we are doing now. More importantly, we must fix election dates. We need a fixed election date like in the US. This allows everyone—voters, parties and the state—to plan in advance, which cuts costs. Finally, we must also reform candidate selection. The current selection process is top-down, leading to ‘tourist candidates’. Such candidates generally tend to spend more than other candidates. The candidate selection should be bottom-up so party workers feel ownership and don’t need to be ‘bought’. There is a lot of buzz about ‘out-of-constituency’ and ‘out-of-country’ voting. Are those actually attainable, or just political rhetoric? Let me tell you a story from 2008. Non-Resident Nepalis were raising this issue back then too. Politicians go abroad, enjoy the hospitality of these organisations, and promise them voting rights. But when they are back in Parliament, they say, “Time isn’t ripe for such legislation.” My blunt answer is: Until we have internet or online voting, promising everyone abroad a vote is a lie. You cannot expect millions scattered across the world to visit an embassy to cast a paper ballot. We have been ‘studying’ this for 15 years. My suggestion to the current government was: Include it in the law, but for this election, do it as a pilot project in a few places. This would build confidence and show us the gaps. If we don’t start now, we will keep losing time. We also have to consider justice for those in the Gulf or in India—how do we guarantee them their rights? Why haven’t we used the Electronic Voting Machines (EVMs) you piloted in 2008? In 2008, we piloted EVMs in Kathmandu-1. It was a success—results were fast, and the lines moved quickly. We then expanded it to five diverse districts—Morang, Janakpur, Kaski, Rolpa and Kanchanpur—during the next by-elections. It worked perfectly everywhere. Our voters are intelligent enough to use this technology. The failure to move forward is not a lack of technology, but a lack of will. Recently, the police spokesperson said they are short of 1,600 four-wheelers. Why are we always scrambling for resources at the last minute? Two reasons: first, the country was preparing for 2027, not this March. Second, the Gen Z movement destroyed a lot of police infrastructure and vehicles. Again, this is why we need a fixed election date. In 2008, we had a massive crisis where 1,300 police posts were displaced. We had to ask India for hundreds of vehicles and communication systems. They provided everything from hardware to software that allowed us to monitor 20,000 locations from Kathmandu. This shows our national capacity gap is an ongoing issue. Finally, regarding the 33 percent female representation guideline, parties are blatantly ignoring it in direct nominations. How do we fix this? In many countries, there isn’t even a relevant law, but the leadership feels it is necessary. In Nepal, leaders only follow the law when they are compelled by legislation. In 2008, we had to threaten to stop the election to get the 33 percent representation into the law. Even now, parties only meet this through the Proportional Representation (PR) system. For example, the CPN-UML won 41 PR seats in 2022 but had to give 38 of those to women to meet the legal quota, leaving only three for men. The hard reality is that until they are compelled by the constitution, the parties won’t do it. In the next constitutional review, we must establish these rights, so they cannot be ignored. Dawadi is an Op-Ed Editor at the Post."
    },
    {
        "url": "https://kathmandupost.com/interviews/2026/01/12/free-and-fair-election-key-to-restoring-nepal-s-international-reputation",
        "title": "Free and fair election key to restoring Nepal’s international reputation",
        "content": "The country burned during the two days of the Gen Z protests and in the four months since, Nepal is marked by an overall state of uncertainty. The investigation into the state suppression of the protests is yet to be finalised. The Gen Z-ers are still divided over the agendas of the movement. Amidst the chaos, the only silver lining seems to be an increasingly conducive climate for the upcoming elections on March 5. The Post’s Biken K Dawadi sat down with veteran international jurist Surya Subedi, professor at the University of Leeds and former UN Special Rapporteur for human rights in Cambodia, to discuss the human rights violations during the protests, the investigation and report of the probe panel formed to investigate the incident, international observation of the upcoming elections and the recent capture of Venezuelan President by the US. Excerpts. How do you analyse the recent Gen Z protests and the subsequent state suppression? First of all, the Gen Z movement was a medium; there was widespread dissatisfaction in the country. There was a lack of good governance, corruption was rampant, and the government had failed to deliver. This widespread discontent in Nepali society was expressed through the protests. Consequently, the force used—including targeting people above the knee—was a condemnable act. International standards do not accept such actions. Further, after so many people died, there should have been an immediate investigation to collect evidence. In this regard, the government of Nepal and various state mechanisms failed. Nepal has a history of making immature decisions during crises. One must have patience. Instead of dissolving Parliament, it should have been used as a platform where Gen Z could voice their demands for new laws. What is your view of the state investigation into the incident? There is a saying, ‘Hit the iron while it is hot’, but that did not happen in Nepal. The momentum of the Gen Z movement and its dissatisfaction should have been made legally meaningful. Before the President dissolved Parliament, there should have been a week or two of ‘homework’ to address why the Constitution was not working, what contemporary institutional changes were needed, and what new laws should be drafted. Instead, the demand of the Gen Z movement was in one direction, and the government’s response was in another. They likely weren’t asking for mid-term elections or the dissolution of Parliament. In Nepal, it often happens that there is a movement for one demand, but a completely different decision is made. This movement was an opportunity; as a Nepali poet said, ‘one who misses an opportunity is a fool’. While the constitutional structure is generally fine, there are many problems in its implementation. Power is centralised in the hands of the prime minister and the leaders of the major parties. Neither the Members of Parliament nor other government mechanisms have much value; the country revolves around the clashes of three or four top leaders who lack capacity, study and vision. Experts often emphasise the international law doctrines of proportionality, necessity and legitimacy on the use of force. The terms ‘proportionality’ and ‘necessity’ sound a bit vague—how are they actually measured? I dealt with similar violence in the context of Cambodia, where I served as the United Nations Special Rapporteur for six years. When casualties happened there, I went immediately and questioned the rulers. I had a three-hour meeting with the prime minister and most of the Cabinet members, where I told them they had not met the international criteria of proportionality, necessity and legitimacy. This put them under pressure to accept my suggestions for judicial and political reforms. In Nepal, however, there was a lack of international involvement, and national power centres were in a state of confusion. If the protest on the first day had been managed properly, the destruction on the following day would likely have been less. The state machinery failed to manage the initial protests. Regarding proportionality, the force used was far beyond what the demonstration called for. It was not necessary to start shooting immediately. If they hadn’t opened fire, the movement would not have turned so violent, and the next day’s destruction might have been avoided. The use of force in Nepal fell outside the standards of legitimacy, necessity and proportionality. Did the absence of significant international pressure on Nepal contribute to the delay in the investigation? The international community’s reaction was different as the situations in Cambodia and Nepal are different. Cambodia was a country emerging from long-term conflict, and I was a country-specific mandate holder for the UN, so they had to listen to me. In Nepal, such a representative isn’t present, and arguably wasn’t necessary. After the 2015 Constitution, Nepal was trying to get back on a democratic track. In such a country, a heavy international presence is not required. However, the National Human Rights Commission (NHRC) and other structures in Nepal failed to work effectively. The issues I raised in Cambodia as a UN representative could have been raised by the NHRC. They could have immediately told the government they were using force against international standards and held them accountable. Instead, they are just taking statements and conducting studies; I fear this issue will simply fade away. The Karki Commission is to submit its report to the government in 10 days. What are the ‘must-haves’ of that report? They should focus on two things. First, they should look at international practices, such as those in South Africa or Cambodia, to see what international standards for the use of force are. Nepal is legally more developed than Cambodia in terms of structure. Second, they must analyse national and international laws based on objective facts and offer two types of suggestions: immediate actions for the government and long-term policy recommendations. In Cambodia, I arrived five days after the casualties to collect evidence immediately. If you delay, evidence is lost. The government must act on immediate tasks, but it’s already getting late. Memories of the September protests are fading, and the commission’s job is to ensure that doesn’t happen. Leaders in Nepal do not seem to value human life. A single casualty is a major crisis for a country, but here, many young people died, and their blood was spilled. What is the result of that sacrifice? Is it just a mid-term election? I fear we are just returning to the same old state. Regarding the state's response, how much moral or legal responsibility can we tie to the political leaders who were in power at that time? Former Prime Minister KP Oli resigned, partly because he was forced to. However, based on international standards, he should have resigned on moral grounds anyway. When there is such destruction and loss of life at the seat of the government—like the fires at Singha Durbar and the Supreme Court—the state machinery he headed failed. But the tradition of taking moral responsibility is not established in Nepal. Let’s change track to the upcoming elections. Are there necessary changes needed in our electoral laws and rights protections? Democracy is maturing in Nepal. In the last two elections, no major party claimed there was fraud; the electoral process was, by and large, free and fair. We should hope for the same now. Nepal has well-established electoral systems, laws and practices. I am optimistic that the election will be free from rigging. Further, the international community is watching Nepal closely. To regain the trust of foreign investors and partners in our democratic system, a free and fair election is essential. If that happens, Nepal will bounce back. Are there specific international law indicators or thresholds that allow us to say an election is ‘free and fair’? In international law, we talk about ‘hard laws’ (binding treaties) and ‘soft laws’ (principles, declarations and recommendations). To ensure an election is free and fair, three things are key: the period before, during, and immediately after the election. Specific indicators include the neutrality of security apparatuses, the neutrality of the civil service, no misuse of government-owned media and proper tracking and regulation of election spending. In some countries, like under Saddam Hussein in Iraq or Hosni Mubarak in Egypt, leaders would get 99 percent of the vote by misusing the entire state machinery. Nepal is different; as in India, the electoral practice is generally established as free, fair and neutral. If we can send the message that our system is robust, the results will gain international recognition and legitimacy. How will international organisations like the UN be watching this election, especially given the state of uncertainty and questions about the government’s constitutionality? Some might question the legitimacy of the government led by Sushila Karki, but the international community understands that it came into power under extraordinary circumstances. What they look at is not just the government’s legitimacy but whether all major political powers are participating. In some Asian or African countries, the main opposition boycotts the election, which draws international concern. In Nepal, almost all of the roughly 150 parties are participating, which is a very positive sign. Election is the way out of this chaos. The political parties are acting responsibly by participating. After the election, we must convey the message that Nepal is back on track to build confidence, not just with nation-states but with investors. We must show we have addressed the concerns of Gen Z. A major weakness I see is that while parties are contesting elections, they are focused only on how to reach and share power. I don’t see specific programs for economic progress. Nepal’s international reputation has suffered due to corruption and the destruction caused by the recent uprising. This has created a crisis of confidence internationally, particularly regarding the decision-making capacity of Nepali leaders. A free and fair election is key to restoring Nepal's international reputation. Let’s move on to a topic of worldwide interest: The recent capture of Venezuelan President Nicolas Maduro via a US military operation. What are your impressions of this from an international law angle? I look at this from two perspectives: as a human rights activist and as a student of international law. From a human rights perspective, there were long-term violations in Venezuela, as highlighted by UN reports; some form of address was necessary. However, the intervention was against the UN Charter. From an international law standpoint, it was a violation. While the previous elections in Venezuela were questioned internationally for their fairness, kidnapping a sitting president at night and bringing him to New York is a violation of various international laws, not just the UN Charter. For smaller states in the Global South like Nepal, does this ‘Might is right’ approach set a dangerous precedent? Should we be worried? Not just small countries like Nepal, but all countries should be worried. This development challenges the concept of a rules-based international order and the global governance framework established after World War II. To understand the current state of international law, we can think of it as a fragile glass bridge; it allows for passage and connection, but when a major power stomps heavily by ignoring the rules, the cracks threaten everyone walking upon it. Dawadi is an Op-Ed Editor at the Post."
    },
    {
        "url": "https://english.nepalpress.com/2026/02/13/pm-karki-appeals-all-to-actively-participate-in-elections-to-give-political-outlet-to-nation/",
        "title": "PM Karki appeals all to actively participate in elections to give political outlet to nation – Nepal Press",
        "content": "Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language KATHMANDU: Prime Minister Sushila Karki has urged one and all to actively participate in the upcoming elections to ensure the country’s progress. PM Karki made this appeal while interacting with locals in Pathibhara, Taplejung during her visit to the eastern hill districts today. She emphasized that everyone’s contribution is necessary to ensure a peaceful election. Prime Minister Karki also held discussions in Phungling with the Chief Election Officer, Chief District Officer, and district chiefs of security agencies regarding election preparations and security, said the PM’s press advisor Ram Bahadur Rawal. Prime Minister Karki also visited the Pathibhara Temple during her tour of the eastern hill districts today. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Please enter an answer in digits:three × four =   Nepal E. Press Media Pvt. Ltd.\n\t\t\t\t\t\t\t\tMinbhawan, New Baneshwor, Kathmandu \n\t\t\t\t\t\t\t\tPhone: +977 1 5909011 ,+977 1 5909021 \n\t\t\t\t\t\t\t\tEmail: [email protected], [email protected] Copyright © 2026 NepalPress. All Rights Reserved.\n\t\t\t\t Website Design by Genesiswtech.com"
    },
    {
        "url": "https://english.nepalpress.com/2026/02/13/20-days-left-for-hor-elections-transporting-ballot-papers-to-10-districts-begins/",
        "title": "20 days left for HoR elections: Transporting ballot papers to 10 districts begins – Nepal Press",
        "content": "Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language KATHMANDU: The Election Commission (EC) has started dispatching ballot papers to 12 electoral constituencies in 10 districts of Karnali Province. According to the EC, ballot papers have been transported to the constituencies of Salyan, Rukum West, Dolpa, Mugu, Humla, Kalikot, Jumla, Jajarkot, Dailekh, and Surkhet in Karnali province, informed EC’s deputy spokesperson Prakash Neupane. Likewise, the commission stated that ballot printing has been completed for 124 constituencies in 58 districts. A total of 15,778,000 ballots have been printed. A total of 14,341 boxes ballot papers, according to the EC, have been packed so far. Currently, around 1,000 boxes of ballot papers are being packed daily and 1.3 to 1.5 million ballot papers are being printed. Ballot papers for the House of Representatives elections are being printed at Janak Education Materials Center Limited, Sano Thimi. In the first phase, 1,098,200 sample ballot papers were printed and sent to various districts, the EC stated. A total of 20,830,000 ballot papers for the HoR election towards proportional representation were printed, packed, registered, and prepared for transportation, it has been informed. Similarly, the EC has stated that 20,323,000 ballot papers are required to be printed for the First-Past-the-Post (FPTP) election. Printing of ballot papers for the direct election system began on January 30. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Please enter an answer in digits:thirteen + seventeen =   Nepal E. Press Media Pvt. Ltd.\n\t\t\t\t\t\t\t\tMinbhawan, New Baneshwor, Kathmandu \n\t\t\t\t\t\t\t\tPhone: +977 1 5909011 ,+977 1 5909021 \n\t\t\t\t\t\t\t\tEmail: [email protected], [email protected] Copyright © 2026 NepalPress. All Rights Reserved.\n\t\t\t\t Website Design by Genesiswtech.com"
    },
    {
        "url": "https://english.nepalpress.com/2026/02/06/ec-to-depute-volunteers-in-all-wards-for-voter-education/",
        "title": "EC to depute volunteers in all wards for voter education – Nepal Press",
        "content": "Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language KATHMANDU: The Election Commission (EC) is to depute volunteers in all wards across the country for voter education. The election to the House of Representatives is taking place across the country on March 5. According to the EC, volunteers are going to be deputed in all 6743 wards of the country through the District Election Offices. Assistant Spokesperson of EC, Kul Bahadur GC, said experienced child development facilitators, women health volunteers and community service center operators would be appointed for voter education. The process for appointing volunteers has begun, he added. The EC has already approved the voter education related program on February 2 for this purpose. Preparation has been made to impart orientation on February 15 in all seven provinces by appointing volunteers for voter education. The volunteers would be deputed in all 6,743 wards of 753 local levels from mid-February, added EC. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Please enter an answer in digits:thirteen − 11 =   Nepal E. Press Media Pvt. Ltd.\n\t\t\t\t\t\t\t\tMinbhawan, New Baneshwor, Kathmandu \n\t\t\t\t\t\t\t\tPhone: +977 1 5909011 ,+977 1 5909021 \n\t\t\t\t\t\t\t\tEmail: [email protected], [email protected] Copyright © 2026 NepalPress. All Rights Reserved.\n\t\t\t\t Website Design by Genesiswtech.com"
    },
    {
        "url": "https://english.nepalpress.com/2026/02/12/no-alternative-to-election-pm-karki/",
        "title": "No alternative to election: PM Karki – Nepal Press",
        "content": "Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language SOLUKHUMBU: Prime Minister Sushila Karki has said that  voting in the mountainous and hilly districts will be held on March 5 under any circumstances. The Prime Minister arrived in Solukhumbu today to assess election preparations, relevant security arrangements, and geographical challenges. On the occasion, she stated that there is no situation that would warrant postponing the election, emphasizing that the election must be held as scheduled. “There is no alternative to holding the election on March 5 to free the country from the cycle of instability,” she said. Acknowledging the challenges of conducting elections in mountainous regions, she added that the government has already made necessary arrangements to address such adversities. The Prime Minister urged voters, political parties, and candidates to remain confident that the election will be conducted in a fearless, peaceful, and impartial atmosphere. According to her, the government’s entire focus is now on ensuring the election is held in a cordial environment. She also called on all concerned bodies to concentrate their efforts on the polls. During a briefing with the District Security Committee, the Prime Minister specifically directed authorities to create an environment where voters can cast their ballots without fear, pressure, or influence. She instructed the concerned authorities to leave no stone unturned in guaranteeing security at remote polling stations in the mountainous areas, and directed them to mobilize additional security forces if necessary. On the occasion, Chief District Officer Leela Kumari Pandey KC presented a detailed briefing to the Prime Minister, highlighting the district’s overall security situation, the physical status of polling centers, and their accessibility. After reviewing the details, the Prime Minister directed the authorities to take special precautions regarding security, transportation of election materials, and the safety of ballot papers, according to CDO Pandey. Solukhumbu, the part of Koshi Province, has 123 polling stations. The District Administration Office stated that alternative plans have been prepared in view of possible snowfall, climate conditions, and geographical challenges. The Prime Minister said it is the constitutional responsibility of the government to ensure the voting rights of people in all areas, including mountainous regions. She assured that necessary arrangements would be made to enable the voters of Solukhumbu to cast their ballots in an easy and accessible manner. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Please enter an answer in digits:twenty + 18 =   Nepal E. Press Media Pvt. Ltd.\n\t\t\t\t\t\t\t\tMinbhawan, New Baneshwor, Kathmandu \n\t\t\t\t\t\t\t\tPhone: +977 1 5909011 ,+977 1 5909021 \n\t\t\t\t\t\t\t\tEmail: [email protected], [email protected] Copyright © 2026 NepalPress. All Rights Reserved.\n\t\t\t\t Website Design by Genesiswtech.com"
    },
    {
        "url": "https://english.nepalpress.com/2026/02/12/hor-polls-ec-asks-fptp-candidates-to-submit-election-manifestos/",
        "title": "HoR polls: EC asks FPTP candidates to submit election manifestos – Nepal Press",
        "content": "Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language KATHMANDU: The Election Commission (EC) has called on all first-past-the-post (FPTP) candidates for the March 5 election to the House of Representatives ( HoR)  to submit a copy of their election manifesto to the respective Election Officer’s Office by February 15. The EC has written to all FPTP candidates, directing them to make their election manifestos public and submit a copy to the Election Commission Office in accordance with Clause 37 of the Election Code of Conduct, 2082 BS. Similarly, Election Offices in all provinces and the respective Election Officers’ Offices have been instructed to maintain records of the submitted manifestos and provide the details to the Commission. Earlier, the EC had also written to political parties, urging them to unveil their election manifestos by February 15. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Please enter an answer in digits:18 − 11 =   Nepal E. Press Media Pvt. Ltd.\n\t\t\t\t\t\t\t\tMinbhawan, New Baneshwor, Kathmandu \n\t\t\t\t\t\t\t\tPhone: +977 1 5909011 ,+977 1 5909021 \n\t\t\t\t\t\t\t\tEmail: [email protected], [email protected] Copyright © 2026 NepalPress. All Rights Reserved.\n\t\t\t\t Website Design by Genesiswtech.com"
    },
    {
        "url": "https://english.nepalpress.com/2026/02/10/pm-karki-urges-security-bodies-to-remain-on-high-alert-for-election-security/",
        "title": "PM Karki urges security bodies to remain on high-alert for election security – Nepal Press",
        "content": "Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language Nepal Press Facts First, Truth Foremost – Online News Portal from Nepal in Nepali & English Language KATHMANDU: Prime Minister Sushila Karki has directed the security bodies to remain on high alert in order to make election security trustworthy. Addressing the Division Commanders’ Coordination meeting which began today at the Nepal Army Headquarters, on the eve of Maha Shivaratri and Army Day, Prime Minister Karki suggested not repeating any mistake and gaps in coordination among security mechanisms. She mentioned, “I request the Nepal Army to work flawlessly in coordination with all security bodies based on security sensitivity by analyzing the experience of previous elections in order to hold the upcoming election in a safe environment.” The Prime Minister clarified that she was fully confident that the Army would carry out its assigned responsibilities in an excellent manner in accordance with the Integrated Security Plan for the Election to the House of Representatives, 2082. Directing to create an environment to run political activities of all political parties without any hindrance, she asked the NA to move ahead with a clear action plan in coordination with other security bodies. Chiefs of different departments of NA, Directorate General and Directorates as well as the Division Commanders have participated in the meeting On the occasion, Chief of the Army Staff Ashok Raj Sigdel briefed the meeting about the overall security situation. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Please enter an answer in digits:thirteen + 19 =   Nepal E. Press Media Pvt. Ltd.\n\t\t\t\t\t\t\t\tMinbhawan, New Baneshwor, Kathmandu \n\t\t\t\t\t\t\t\tPhone: +977 1 5909011 ,+977 1 5909021 \n\t\t\t\t\t\t\t\tEmail: [email protected], [email protected] Copyright © 2026 NepalPress. All Rights Reserved.\n\t\t\t\t Website Design by Genesiswtech.com"
    }
]